src/Reports/ОтчётПоРемонтуПолный/ОтчётПоРемонтуПолный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоРемонтуПолный</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/Documents/РемонтнаяКарта/РемонтнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РемонтнаяКарта</name>
  <basedOn>Document.ПроизводственноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеремонтопригодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРемонта</name>
    <type>
      <types>CatalogRef.ПричиныРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоРазукомплектовки</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтложен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Неисправности</name>
    <attributes>
      <name>ПозицияНеисправногоМПЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеисправныйМПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияМестаНахожденияБрака</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоНахожденияБрака</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапЖизненногоЦикла</name>
      <type>
        <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидБрака</name>
      <type>
        <types>CatalogRef.ВидыБрака</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаменяемыеЭлементы</name>
    <attributes>
      <name>НормаРасхода</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДвижениеМПЗ</types>
        <types>DocumentRef.СписаниеМПЗПрочее</types>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разукомплектовка</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчётПоРемонтуПолный/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()

ТабДок.Очистить();
ТаблицаРемонта = Новый ТаблицаЗначений;

ТаблицаРемонта.Колонки.Добавить("КодРМ",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2,0)));
ТаблицаРемонта.Колонки.Добавить("РабочееМесто",Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаЛинеек"));
ТаблицаРемонта.Колонки.Добавить("Изделие",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(50)));
ТаблицаРемонта.Колонки.Добавить("БарКод",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(17)));
ТаблицаРемонта.Колонки.Добавить("РемонтнаяКарта",Новый ОписаниеТипов("ДокументСсылка.РемонтнаяКарта"));
ТаблицаРемонта.Колонки.Добавить("ВидБрака",Новый ОписаниеТипов("СправочникСсылка.ВидыБрака"));
ТаблицаРемонта.Колонки.Добавить("ПричинаБрака",Новый ОписаниеТипов("СправочникСсылка.ПричиныРемонта"));
ТаблицаРемонта.Колонки.Добавить("ПозицияНеисправногоМПЗ",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(10)));
ТаблицаРемонта.Колонки.Добавить("НеисправныйМПЗ",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(100)));
ТаблицаРемонта.Колонки.Добавить("МестоНахожденияБрака");

ТаблицаРемонтаКоды = Новый ТаблицаЗначений;

ТаблицаРемонтаКоды.Колонки.Добавить("РемонтнаяКарта",Новый ОписаниеТипов("ДокументСсылка.РемонтнаяКарта"));
ТаблицаРемонтаКоды.Колонки.Добавить("Отправлено",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7,3)));
ТаблицаРемонтаКоды.Колонки.Добавить("Отремонтировано",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7,3)));
ТаблицаРемонтаКоды.Колонки.Добавить("ВРемонтеНач",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7,3)));

	Если ВидОтчёта = 8 Тогда
	Макет = Отчеты.ОтчётПоРемонтуПолный.ПолучитьМакет("ДляВыгрузки");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблИзделие = Макет.ПолучитьОбласть("Изделие");
	Иначе	
		Если ВидОтчёта = 1 Тогда
		Макет = Отчеты.ОтчётПоРемонтуПолный.ПолучитьМакет("ПоИзделиям");
		ОблИзделие = Макет.ПолучитьОбласть("Изделие");
		ОблИтогоИзделие = Макет.ПолучитьОбласть("ИтогоИзделие");
		ИначеЕсли ВидОтчёта = 2 Тогда
		Макет = Отчеты.ОтчётПоРемонтуПолный.ПолучитьМакет("ПоРабочимМестам");
		ОблРМ = Макет.ПолучитьОбласть("РМ");
		ОблИтогоРМ = Макет.ПолучитьОбласть("ИтогоРМ");
		ИначеЕсли ВидОтчёта = 3 Тогда
		Макет = Отчеты.ОтчётПоРемонтуПолный.ПолучитьМакет("ПоВидамБрака");
		ОблВН = Макет.ПолучитьОбласть("ВН");
		ОблИтогоВН = Макет.ПолучитьОбласть("ИтогоВН");
		ИначеЕсли ВидОтчёта = 4 Тогда
		Макет = Отчеты.ОтчётПоРемонтуПолный.ПолучитьМакет("ПоРемонтируемымПФ");
		ОблПФ = Макет.ПолучитьОбласть("ПФ");
		ОблИтогоПФ = Макет.ПолучитьОбласть("ИтогоПФ");
		ИначеЕсли ВидОтчёта = 5 Тогда
		Макет = Отчеты.ОтчётПоРемонтуПолный.ПолучитьМакет("ПоНеисправнымЭлементам");
		ОблЭлемент = Макет.ПолучитьОбласть("Элемент");
		ОблИтогоЭлемент = Макет.ПолучитьОбласть("ИтогоЭлемент");
		ИначеЕсли ВидОтчёта = 6 Тогда
		Макет = Отчеты.ОтчётПоРемонтуПолный.ПолучитьМакет("ПоСтандартнымКомментариям");
		ОблСтандартныйКомментарий = Макет.ПолучитьОбласть("СтандартныйКомментарий");
		ОблИтогоСтандартныйКомментарий = Макет.ПолучитьОбласть("ИтогоСтандартныйКомментарий");
		ИначеЕсли ВидОтчёта = 7 Тогда
		Макет = Отчеты.ОтчётПоРемонтуПолный.ПолучитьМакет("ПоМестамВозникновенияБрака");
		ОблМестоВозникновенияБрака = Макет.ПолучитьОбласть("МестоВозникновенияБрака");
		ОблИтогоМестоВозникновенияБрака = Макет.ПолучитьОбласть("ИтогоМестоВозникновенияБрака");
		КонецЕсли;	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблКод = Макет.ПолучитьОбласть("Код");	
	ОблЭлементРемонта = Макет.ПолучитьОбласть("ЭлементРемонта");
	ОблКонец = Макет.ПолучитьОбласть("Конец");	
	КонецЕсли; 	
ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
ОблШапка.Параметры.ДатаВывода = ТекущаяДата();
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтнаяКарта.Ссылка,
	|	РемонтнаяКарта.ДатаНачала,
	|	РемонтнаяКарта.ДатаОкончания,
	|	РемонтнаяКарта.ДокументОснование,
	|	РемонтнаяКарта.РабочееМесто,
	|	РемонтнаяКарта.Изделие,
	|	РемонтнаяКарта.БарКод,
	|	РемонтнаяКарта.Изделие,
	|	РемонтнаяКарта.ПричинаРемонта,
	|	РемонтнаяКарта.Количество
	|ИЗ
	|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
	|ГДЕ
	|	РемонтнаяКарта.ПометкаУдаления = ЛОЖЬ
	|	И РемонтнаяКарта.ДатаНачала <= &ДатаКон";
	Если СписокЛинеек.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.Линейка В(&СписокЛинеек)";
	Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
	КонецЕсли;
		Если СписокПодразделений.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.Линейка.Подразделение В(&СписокПодразделений)";
		Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
		КонецЕсли;
			Если СписокГруппСпецификаций.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.Изделие В ИЕРАРХИИ(&СписокГруппСпецификаций)";
			КонецЕсли;
				Если СписокВидовРемонта.Количество() > 0 Тогда
				Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.ВидРемонта В(&СписокВидовРемонта)";
				КонецЕсли; 
					Если Не ОграничениеПоИзделию.Пустая() Тогда
					Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.Изделие = &ОграничениеПоИзделию";
					КонецЕсли;  	
						Если Не ОграничениеПоРабочемуМесту.Пустая() Тогда
						Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.РабочееМесто = &ОграничениеПоРабочемуМесту";
						КонецЕсли; 
							Если Не ОграничениеПоПричинеРемонта.Пустая() Тогда
							Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.ПричинаРемонта = &ОграничениеПоСтандартномуКомментарию";
							КонецЕсли; 
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокГруппСпецификаций",СписокГруппСпецификаций);
Запрос.УстановитьПараметр("СписокВидовРемонта",СписокВидовРемонта);
Запрос.УстановитьПараметр("ОграничениеПоИзделию",ОграничениеПоИзделию);
Запрос.УстановитьПараметр("ОграничениеПоРабочемуМесту",ОграничениеПоРабочемуМесту);
Запрос.УстановитьПараметр("ОграничениеПоПричинеРемонта",ОграничениеПоПричинеРемонта);
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	Отправлено = 0;
	Отремонтировано = 0;
	ВРемонтеНач = 0; 
		Если Выборка.ДатаНачала >= Отчет.Период.ДатаНачала Тогда
		Отправлено = ?(Выборка.Количество = 0,1,Выборка.Количество);			
		Иначе
		ВРемонтеНач = ?(Выборка.Количество = 0,1,Выборка.Количество);
		КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
				Если Выборка.ДатаОкончания < Отчет.Период.ДатаНачала Тогда				
				Продолжить;
				КонецЕсли; 
					Если (Выборка.ДатаОкончания >= Отчет.Период.ДатаНачала)и(Выборка.ДатаОкончания <= Отчет.Период.ДатаОкончания) Тогда
					Отремонтировано = ?(Выборка.Количество = 0,1,Выборка.Количество);
					КонецЕсли;			
			КонецЕсли; 
	ТЧКоды = ТаблицаРемонтаКоды.Добавить();
	ТЧКоды.РемонтнаяКарта = Выборка.Ссылка;
	ТЧКоды.Отправлено = Отправлено;
	ТЧКоды.Отремонтировано = Отремонтировано;
	ТЧКоды.ВРемонтеНач = ВРемонтеНач;
		Если Выборка.Ссылка.Неисправности.Количество() > 0 Тогда
			Для каждого Неисправность Из Выборка.Ссылка.Неисправности Цикл 
				Если ЗначениеЗаполнено(ОграничениеПоВидуБрака) Тогда
					Если Неисправность.ВидБрака <> ОграничениеПоВидуБрака Тогда
					Продолжить;
					КонецЕсли;
				КонецЕсли; 
					Если ЗначениеЗаполнено(ОграничениеПоНеисправномуМПЗ) Тогда
						Если Неисправность.НеисправныйМПЗ <> ОграничениеПоНеисправномуМПЗ Тогда
						Продолжить;
						КонецЕсли;
					КонецЕсли;
						Если ЗначениеЗаполнено(ОграничениеПоМестуНахожденияБрака) Тогда
							Если Неисправность.МестоНахожденияБрака <> ОграничениеПоМестуНахожденияБрака Тогда
							Продолжить;
							КонецЕсли;
						КонецЕсли;	
			ТЧ = ТаблицаРемонта.Добавить();
			ТЧ.КодРМ = Выборка.РабочееМесто.Код;
			ТЧ.РабочееМесто = Выборка.РабочееМесто;
				Если ТипЗнч(Выборка.ДокументОснование) <> Тип("ДокументСсылка.ПроизводственноеЗадание") Тогда
				ТЧ.Изделие = СокрЛП(Выборка.Ссылка.Наименование);
				Иначе
				ТЧ.Изделие = СокрЛП(Выборка.ДокументОснование.Изделие.Наименование);
				КонецЕсли; 
			ТЧ.БарКод = Выборка.БарКод;
			ТЧ.РемонтнаяКарта = Выборка.Ссылка;
			ТЧ.ВидБрака = Неисправность.ВидБрака;
			ТЧ.ПозицияНеисправногоМПЗ = Неисправность.ПозицияНеисправногоМПЗ;
			ТЧ.НеисправныйМПЗ = Неисправность.НеисправныйМПЗ;
			ТЧ.МестоНахожденияБрака = Неисправность.МестоНахожденияБрака;		
			ТЧ.ПричинаРемонта = Выборка.ПричинаРемонта;		
			КонецЦикла;
		Иначе
			Если ЗначениеЗаполнено(ОграничениеПоВидуБрака) Тогда
			Продолжить;
			КонецЕсли; 
				Если ЗначениеЗаполнено(ОграничениеПоНеисправномуМПЗ) Тогда
				Продолжить;
				КонецЕсли;
					Если ЗначениеЗаполнено(ОграничениеПоМестуНахожденияБрака) Тогда
					Продолжить;
					КонецЕсли;
						Если ЗначениеЗаполнено(ГруппаВидовНеисправностей) Тогда
						Продолжить;
						КонецЕсли;
		ТЧ = ТаблицаРемонта.Добавить();
		ТЧ.КодРМ = Выборка.РабочееМесто.Код;
		ТЧ.РабочееМесто = Выборка.РабочееМесто;
			Если ТипЗнч(Выборка.ПроизводственноеЗадание) <> Тип("ДокументСсылка.ПроизводственноеЗадание") Тогда
			ТЧ.Изделие = СокрЛП(Выборка.Ссылка.Наименование);
			Иначе
			ТЧ.Изделие = СокрЛП(Выборка.ПроизводственноеЗадание.Изделие.Наименование);
			КонецЕсли; 
		ТЧ.БарКод = Выборка.БарКод;
		ТЧ.РемонтнаяКарта = Выборка.Ссылка;
		ТЧ.СтандартныйКомментарий = Выборка.СтандартныйКомментарий;
		КонецЕсли;  
	КонецЦикла;
		Если (ВидОтчёта = 1)или(ВидОтчёта = 8) Тогда
		ТаблицаРемонта.Сортировать("Изделие,РемонтнаяКарта");
		ТекИзделие = "";
		ИначеЕсли ВидОтчёта = 2 Тогда
		ТаблицаРемонта.Сортировать("РабочееМесто,РемонтнаяКарта");		
		ТекРМ = Справочники.РабочиеМестаЛинеек.ПустаяСсылка();
		ИначеЕсли ВидОтчёта = 3 Тогда
		ТаблицаРемонта.Сортировать("ВидБрака,РемонтнаяКарта");		
		ТекВН = Справочники.ВидыНеисправностей.ПустаяСсылка();
		ИначеЕсли ВидОтчёта = 4 Тогда
		ТаблицаРемонта.Сортировать("НаисправныйМПЗ,РемонтнаяКарта");		
		ТекПФ = Справочники.Номенклатура.ПустаяСсылка();
		ИначеЕсли ВидОтчёта = 5 Тогда
		ТаблицаРемонта.Сортировать("МестоНахожденияБрака,РемонтнаяКарта");		
		ТекЭлемент = "";
		ИначеЕсли ВидОтчёта = 6 Тогда
		ТаблицаРемонта.Сортировать("СтандартныйКомментарий,РемонтнаяКарта");		
		ТекСтандартныйКомментарий = "";
		ИначеЕсли ВидОтчёта = 7 Тогда
		ТаблицаРемонта.Сортировать("МестоВозникновенияБрака,РемонтнаяКарта");		
		ТекМестоВозникновенияБрака = Справочники.ВидыНеисправностей.ПустаяСсылка();
		КонецЕсли; 
КолНачИтого = 0;
КолПрихИтого = 0;
КолРасхИтого = 0;
КолКонИтого = 0;
КолНачВсего = 0;
КолПрихВсего = 0;
КолРасхВсего = 0;
КолКонВсего = 0;
ТекРемонтнаяКарта = Документы.РемонтнаяКарта.ПустаяСсылка();
	Для каждого ТЧ Из ТаблицаРемонта Цикл
		Если ВидОтчёта = 1 Тогда
			Если ТЧ.Изделие <> ТекИзделие Тогда
				Если ЗначениеЗаполнено(ТекИзделие) Тогда
				ОблИтогоИзделие.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоИзделие.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоИзделие.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоИзделие.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоИзделие);	
				КонецЕсли;
			ОблИзделие.Параметры.Изделие = ТЧ.Изделие;
			ТабДок.Вывести(ОблИзделие);
			ТекИзделие = ТЧ.Изделие;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 2 Тогда			
			Если ТЧ.РабочееМесто <> ТекРМ Тогда
				Если Не ТекРМ.Пустая() Тогда
				ОблИтогоРМ.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоРМ.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоРМ.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоРМ.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоРМ);	
				КонецЕсли;
			ОблРМ.Параметры.РабочееМесто = ТЧ.РабочееМесто;
			ТабДок.Вывести(ОблРМ);
			ТекРМ = ТЧ.РабочееМесто;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 3 Тогда			
			Если ТЧ.ВидНеисправности <> ТекВН Тогда
				Если Не ТекВН.Пустая() Тогда
				ОблИтогоВН.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоВН.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоВН.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоВН.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоВН);	
				КонецЕсли;
			ОблВН.Параметры.ВидНеисправности = ТЧ.ВидНеисправности;
			ТабДок.Вывести(ОблВН);
			ТекВН = ТЧ.ВидНеисправности;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 4 Тогда			
			Если ТЧ.ЭтапСпецификации <> ТекПФ Тогда
				Если Не ТекПФ.Пустая() Тогда
				ОблИтогоПФ.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоПФ.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоПФ.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоПФ.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоПФ);	
				КонецЕсли;
			ОблПФ.Параметры.ЭтапСпецификации = ТЧ.ЭтапСпецификации;
			ТабДок.Вывести(ОблПФ);
			ТекПФ = ТЧ.ЭтапСпецификации;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 5 Тогда			
			Если ТЧ.Элемент <> ТекЭлемент Тогда
				Если ТекЭлемент <> "" Тогда
				ОблИтогоЭлемент.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоЭлемент.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоЭлемент.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоЭлемент.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоЭлемент);	
				КонецЕсли;
			ОблЭлемент.Параметры.Элемент = ТЧ.Элемент;
			ТабДок.Вывести(ОблЭлемент);
			ТекЭлемент = ТЧ.Элемент;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 6 Тогда			
			Если ТЧ.СтандартныйКомментарий <> ТекСтандартныйКомментарий Тогда
				Если ТекСтандартныйКомментарий <> "" Тогда
				ОблИтогоСтандартныйКомментарий.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоСтандартныйКомментарий.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоСтандартныйКомментарий.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоСтандартныйКомментарий.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоСтандартныйКомментарий);	
				КонецЕсли;
			ОблСтандартныйКомментарий.Параметры.СтандартныйКомментарий = ТЧ.СтандартныйКомментарий;
			ТабДок.Вывести(ОблСтандартныйКомментарий);
			ТекСтандартныйКомментарий = ТЧ.СтандартныйКомментарий;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 7 Тогда			
			Если ТЧ.МестоВозникновенияБрака <> ТекМестоВозникновенияБрака Тогда
				Если Не ТекМестоВозникновенияБрака.Пустая() Тогда
				ОблИтогоМестоВозникновенияБрака.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоМестоВозникновенияБрака.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоМестоВозникновенияБрака.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоМестоВозникновенияБрака.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоМестоВозникновенияБрака);	
				КонецЕсли;
			ОблМестоВозникновенияБрака.Параметры.МестоВозникновенияБрака = ТЧ.МестоВозникновенияБрака;
			ТабДок.Вывести(ОблМестоВозникновенияБрака);
			ТекМестоВозникновенияБрака = ТЧ.МестоВозникновенияБрака;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;			
		ИначеЕсли ВидОтчёта = 8 Тогда
		ОблИзделие.Параметры.Заполнить(ТЧ);
		ОблИзделие.Параметры.СтандартныйКомментарий = ТЧ.Ремонт.СтандартныйКомментарий;
		ОблИзделие.Параметры.Комментарий = ТЧ.Ремонт.Комментарий;
		ОблИзделие.Параметры.КомментарийРемонтника = ТЧ.Ремонт.КомментарийРемонтника;
		ВыбЗнач = ТаблицаРемонтаКоды.Найти(ТЧ.Ремонт,"Ремонт");
			Если ВыбЗнач <> Неопределено Тогда
			КолНач = ВыбЗнач.ВРемонтеНач;
			КолПрих = ВыбЗнач.Отправлено;
			КолРасх = ВыбЗнач.Отремонтировано;
			КолКон = КолНач + КолПрих - КолРасх;		
			ОблИзделие.Параметры.КолНач = КолНач;
			ОблИзделие.Параметры.КолПрих = КолПрих;
			ОблИзделие.Параметры.КолРасх = КолРасх;
			ОблИзделие.Параметры.КолКон = КолКон;
			Иначе
			ОблИзделие.Параметры.КолНач = 0;
			ОблИзделие.Параметры.КолПрих = 0;
			ОблИзделие.Параметры.КолРасх = 0;
			ОблИзделие.Параметры.КолКон = 0;						
			КонецЕсли;
				Если ЗначениеЗаполнено(ТЧ.Ремонт.ДатаНачала) Тогда
				ОблИзделие.Параметры.Период = ""+ТЧ.Ремонт.ДатаНачала+" - ";				
				КонецЕсли;  
					Если ЗначениеЗаполнено(ТЧ.Ремонт.ДатаОкончания) Тогда
					ОблИзделие.Параметры.Период = ОблИзделие.Параметры.Период+ТЧ.Ремонт.ДатаОкончания;
					КонецЕсли; 
		ТабДок.Вывести(ОблИзделие);
		Продолжить;
		КонецЕсли; 
			Если ТЧ.РемонтнаяКарта <> ТекРемонтнаяКарта Тогда
			ОблКод.Параметры.Заполнить(ТЧ);
			//ОблКод.Параметры.Комментарий = СокрЛП(ТЧ.РемонтнаяКарта.Комментарий.Наименование) + " (" + СокрЛП(ТЧ.РемонтнаяКарта.Комментарий) + ")";
			//ОблКод.Параметры.КомментарийРемонтника = ТЧ.РемонтнаяКарта.КомментарийРемонтника;
			ВыбЗнач = ТаблицаРемонтаКоды.Найти(ТЧ.РемонтнаяКарта,"РемонтнаяКарта");
				Если ВыбЗнач <> Неопределено Тогда
				КолНач = ВыбЗнач.ВРемонтеНач;
				КолПрих = ВыбЗнач.Отправлено;
				КолРасх = ВыбЗнач.Отремонтировано;
				КолКон = КолНач + КолПрих - КолРасх;
				КолНачИтого = КолНачИтого + КолНач;
				КолПрихИтого = КолПрихИтого + КолПрих;
				КолРасхИтого = КолРасхИтого + КолРасх;
				КолКонИтого = КолКонИтого + КолКон;	
				КолНачВсего = КолНачВсего + КолНач;
				КолПрихВсего = КолПрихВсего + КолПрих;
				КолРасхВсего = КолРасхВсего + КолРасх;
				КолКонВсего = КолКонВсего + КолКон;	
				ОблКод.Параметры.КолНач = КолНач;
				ОблКод.Параметры.КолПрих = КолПрих;
				ОблКод.Параметры.КолРасх = КолРасх;
				ОблКод.Параметры.КолКон = КолКон;						
				КонецЕсли; 
					Если ЗначениеЗаполнено(ТЧ.РемонтнаяКарта.ДатаНачала) Тогда
					ОблКод.Параметры.Период = ""+ТЧ.РемонтнаяКарта.ДатаНачала+" - ";				
					КонецЕсли;  
						Если ЗначениеЗаполнено(ТЧ.РемонтнаяКарта.ДатаОкончания) Тогда
						ОблКод.Параметры.Период = ОблКод.Параметры.Период+ТЧ.РемонтнаяКарта.ДатаОкончания;
						КонецЕсли;								
			ТабДок.Вывести(ОблКод);
			ТекРемонтнаяКарта = ТЧ.РемонтнаяКарта;
			КонецЕсли;	
	ОблЭлементРемонта.Параметры.Заполнить(ТЧ);		
	ТабДок.Вывести(ОблЭлементРемонта);			
	КонецЦикла;
		Если ВидОтчёта = 1 Тогда
		ОблИтогоИзделие.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоИзделие.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоИзделие.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоИзделие.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоИзделие);
		ИначеЕсли ВидОтчёта = 2 Тогда
		ОблИтогоРМ.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоРМ.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоРМ.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоРМ.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоРМ);	
		ИначеЕсли ВидОтчёта = 3 Тогда
		ОблИтогоВН.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоВН.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоВН.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоВН.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоВН);
		ИначеЕсли ВидОтчёта = 4 Тогда
		ОблИтогоПФ.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоПФ.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоПФ.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоПФ.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоПФ);
		ИначеЕсли ВидОтчёта = 5 Тогда
		ОблИтогоЭлемент.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоЭлемент.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоЭлемент.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоЭлемент.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоЭлемент);
		ИначеЕсли ВидОтчёта = 6 Тогда
		ОблИтогоСтандартныйКомментарий.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоСтандартныйКомментарий.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоСтандартныйКомментарий.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоСтандартныйКомментарий.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоСтандартныйКомментарий);
		ИначеЕсли ВидОтчёта = 7 Тогда
		ОблИтогоМестоВозникновенияБрака.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоМестоВозникновенияБрака.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоМестоВозникновенияБрака.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоМестоВозникновенияБрака.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоМестоВозникновенияБрака);
		КонецЕсли;
			Если ВидОтчёта <> 8 Тогда
			ОблКонец.Параметры.КолНачВсего = КолНачВсего;
			ОблКонец.Параметры.КолПрихВсего = КолПрихВсего;
			ОблКонец.Параметры.КолРасхВсего = КолРасхВсего;
			ОблКонец.Параметры.КолКонВсего = КолКонВсего;
			ТабДок.Вывести(ОблКонец);
			КонецЕсли; 
ТабДок.ФиксацияСверху = 3;	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("ВидОтчёта") Тогда
	Отчет.Период = ЭтаФорма.Параметры.Период;
	СписокЛинеек = ЭтаФорма.Параметры.Линейки;
	СписокПодразделений = ЭтаФорма.Параметры.Подразделения;
	ВидОтчёта = ЭтаФорма.Параметры.ВидОтчёта;
	СписокГруппСпецификаций = ЭтаФорма.Параметры.ГруппыПродукции;
	СписокВидовРемонта = ЭтаФорма.Параметры.ВидыРемонта;
	ГруппаВидовНеисправностей = ЭтаФорма.Параметры.МестоВозникновенияБрака;
		Если ВидОтчёта = 1 Тогда
		ОграничениеПоИзделию = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 2 Тогда
		ОграничениеПоРабочемуМесту = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 3 Тогда
		ОграничениеПоВидуБрака = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 4 Тогда
		ОграничениеПоРемонтируемомуПФ = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 5 Тогда
		ОграничениеПоНеисправномуМПЗ = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 6 Тогда
		ОграничениеПоПричинеРемонта = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 7 Тогда
		ОграничениеПоМестуВозникновенияБрака = ЭтаФорма.Параметры.Расшифровка;
		КонецЕсли; 	
	СформироватьНаСервере();
	Иначе
	Отчет.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.Период.ДатаОкончания = ТекущаяДата();
	ВидОтчёта = 1;
	КонецЕсли; 
КонецПроцедуры
